<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Spatie\Permission\Models\Permission;

class PermissionSeeder extends Seeder
{

    public function run()
    {
        DB::table('permissions')->orderBy('id','desc')->delete();
        $permissions = [
            'عرض-قسم',
            'اضافة-قسم',
            'تعديل-قسم',
            'حذف-قسم',
            'عرض-دكتور',
            'اضافة-دكتور',
            'تعديل-دكتور',
            'حذف-دكتور',
            'عرض-ممرض',
            'اضافة-ممرض',
            'تعديل-ممرض',
            'حذف-ممرض',
            'عرض-محاسب',
            'اضافة-محاسب',
            'تعديل-محاسب',
            'حذف-محاسب',
            'عرض-عامل',
            'اضافة-عامل',
            'تعديل-عامل',
            'حذف-عامل',
            'عرض-موظف-استقبال',
            'اضافة-موظف-استقبال',
            'تعديل-موظف-استقبال',
            'حذف-موظف-استقبال',
            'عرض-مريض',
            'اضافة-مريض',
            'تعديل-مريض',
            'حذف-مريض',
            'عرض-غرف-المستشفي',
            'اضافة-غرف-المستشفي',
            'تعديل-غرف-المستشفي',
            'حذف-غرف-المستشفي',
            'عرض-غرف-المرضي',
            'اضافة-غرف-المرضي',
            'تعديل-غرف-المرضي',
            'حذف-غرف-المرضي',
            'عرض-تقرير-المريض',
            'اضافة-تقرير-المريض',
            'تعديل-تقرير-المريض',
            'حذف-تقرير-المريض',
            'عرض-فاتورة-المريض',
            'اضافة-فاتورة-المريض',
            'تعديل-فاتورة-المريض',
            'حذف-فاتورة-المريض',
            'عرض-شهور-صرف-الرواتب',
            'اضافة-شهور-صرف-الرواتب',
            'تعديل-شهور-صرف-الرواتب',
            'حذف-شهور-صرف-الرواتب',
            'صرف-الرواتب',
            'تسجيل-الحضور',
            'عرض-صلاحية',
            'اضافة-صلاحية',
            'تعديل-صلاحية',
            'حذف-صلاحية',
            'عرض-ادمن',
            'اضافة-ادمن',
            'تعديل-ادمن',
            'حذف-ادمن',
            'عرض-البروفايل',
            'عرض-الإعدادات',
        ];

        foreach ($permissions as $permission)
        {

            Permission::updateOrCreate(['name'=>$permission]);
        }
    }
}
